# ComputeRoofProjectedArea Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..ComputeRoofProjectedArea Method
ExporterIFCUtils Class See Also
---
Returns the projected area of the room, unscaled.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static double ComputeRoofProjectedArea(
	Element pElem
)
```

Visual Basic
---
```text
Public Shared Function ComputeRoofProjectedArea ( _
	pElem As Element _
) As Double
```

Visual C++
---
```text
public:
static double ComputeRoofProjectedArea(
	Element^ pElem
)
```

# ### Parameters
pElem
    Type: Autodesk.Revit.DB..::..Element The roof.
# ### Return Value
The projected area.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace